using System;
using System.Collections.Generic;
using System.Drawing;
using 游戏服务器.地图类;
using 游戏服务器.模板类;

namespace 游戏服务器.副本类
{
	public static class 九层魔塔
	{
		private static readonly Dictionary<int, string> 魔塔刷新区域表 = new Dictionary<int, string>
		{
			[1] = "九层魔塔一层",
			[2] = "九层魔塔二层",
			[3] = "九层魔塔三层",
			[4] = "九层魔塔四层",
			[5] = "九层魔塔五层",
			[6] = "九层魔塔六层",
			[7] = "九层魔塔七层",
			[8] = "九层魔塔八层",
			[9] = "九层魔塔九层"
		};

		public static Dictionary<int, Point> 魔塔传送阵刷新表 = new Dictionary<int, Point>
		{
			[1] = new Point(1036, 79),
			[2] = new Point(898, 217),
			[3] = new Point(761, 354),
			[4] = new Point(1156, 199),
			[5] = new Point(1018, 337),
			[6] = new Point(881, 474),
			[7] = new Point(1281, 324),
			[8] = new Point(1143, 462),
			[9] = new Point(1006, 599)
		};

		private static int randomNum(int numMin, int numMax, bool setRandom = false)
		{
			return new Random().Next(numMin, numMax);
		}

		public static void 执行(地图实例 地图)
		{
			if (地图.数字变量[5] == 0 && 主程.当前时间 > 地图.节点计时)
			{
				if (地图.玩家列表.Count == 0)
				{
					地图.副本节点 = 255;
				}
				if (地图.副本节点 == 255)
				{
					地图.关闭副本();
				}
				else if (地图.副本节点 == 0)
				{
					地图.副本节点 = 10;
					地图.节点计时 = 主程.当前时间.AddSeconds(3.0);
				}
				else if (地图.副本节点 > 9)
				{
					int num;
					num = 地图.副本节点 % 10;
					int num2;
					num2 = 地图.副本节点 / 10;
					switch (num)
					{
					case 0:
						switch (num2)
						{
						case 1:
							地图.地图公告("<#T:990638>");
							break;
						case 5:
						case 9:
							地图.地图公告("<#T:990637>");
							break;
						case 2:
						case 3:
						case 4:
						case 6:
						case 7:
						case 8:
							地图.地图公告("<#T:990636>");
							break;
						}
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(3.0);
						break;
					case 1:
						switch (num2)
						{
						case 1:
							地图.地图公告("<#T:990638>");
							break;
						case 5:
						case 9:
							地图.地图公告("<#T:990637>");
							break;
						case 2:
						case 3:
						case 4:
						case 6:
						case 7:
						case 8:
							地图.地图公告("<#T:990636>");
							break;
						}
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(3.0);
						break;
					case 2:
						switch (num2)
						{
						case 1:
						{
							地图.地图公告("<#T:990639>");
							int num3;
							num3 = 0;
							List<玩家实例> list;
							list = 地图.获取玩家列表();
							foreach (玩家实例 item in list)
							{
								if (item.角色职业 == 游戏对象职业.战士)
								{
									num3++;
								}
								else if (item.角色职业 == 游戏对象职业.法师)
								{
									num3++;
								}
								else if (item.角色职业 == 游戏对象职业.道士)
								{
									num3++;
								}
								else if (item.角色职业 == 游戏对象职业.刺客)
								{
									num3++;
								}
								else if (item.角色职业 == 游戏对象职业.弓手)
								{
									num3++;
								}
								else if (item.角色职业 == 游戏对象职业.龙枪)
								{
									num3++;
								}
							}
							foreach (玩家实例 item2 in list)
							{
								item2.添加Buff时处理(2563, null);
								item2.添加Buff时处理(2571, null);
								item2.增加Buff层数(2571, num3 - 1);
							}
							break;
						}
						case 3:
						case 4:
							地图.地图公告("<#T:990639>");
							break;
						case 2:
						case 6:
						case 7:
						case 8:
							地图.地图公告("<#T:990653>");
							break;
						}
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(3.0);
						break;
					case 3:
					{
						int num4;
						num4 = 九层魔塔.randomNum(0, 2, setRandom: true);
						switch (num2)
						{
						case 1:
							副本.范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, new Point(1042, 73), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射01", 地图, 0, new Point(1043, 72), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, new Point(1042, 85), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射01", 地图, 0, new Point(1043, 86), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, new Point(1030, 85), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射01", 地图, 0, new Point(1029, 86), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, new Point(1030, 73), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射01", 地图, 0, new Point(1029, 72), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, new Point(1048, 77), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1048, 78), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1048, 79), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, new Point(1036, 91), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1036, 92), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1036, 93), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, new Point(1022, 80), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1022, 81), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1022, 82), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, new Point(1036, 65), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1036, 66), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1036, 67), 禁止复活: true, 立即刷新: true);
							break;
						case 2:
							switch (num4)
							{
							case 0:
								副本.范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, new Point(893, 211), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射02", 地图, 0, new Point(892, 210), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, new Point(904, 210), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射02", 地图, 0, new Point(905, 209), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, new Point(904, 222), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射02", 地图, 0, new Point(905, 223), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, new Point(892, 222), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射02", 地图, 0, new Point(891, 223), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, new Point(885, 217), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(885, 218), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(885, 219), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, new Point(898, 204), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(898, 205), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(898, 206), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, new Point(911, 217), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(911, 218), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(911, 219), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, new Point(897, 231), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(897, 232), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(897, 233), 禁止复活: true, 立即刷新: true);
								break;
							case 1:
								副本.范围刷新怪物从地图实例("镇妖魔将02", 地图, 0, new Point(905, 217), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("镇妖神将02", 地图, 0, new Point(891, 217), 禁止复活: true, 立即刷新: true);
								地图.地图公告("<#T:990644>");
								地图.地图公告("<#T:990644>");
								break;
							case 2:
								副本.范围刷新怪物从地图实例("重甲狂兽人02", 地图, 0, new Point(903, 222), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(903, 223), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("破法狂兽人02", 地图, 0, new Point(893, 212), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, new Point(893, 213), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, new Point(893, 222), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(903, 212), 禁止复活: true, 立即刷新: true);
								break;
							}
							break;
						case 3:
							switch (num4)
							{
							case 0:
								副本.范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, new Point(767, 348), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射03", 地图, 0, new Point(768, 347), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, new Point(767, 359), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射03", 地图, 0, new Point(768, 360), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, new Point(755, 360), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射03", 地图, 0, new Point(754, 361), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, new Point(756, 348), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射03", 地图, 0, new Point(755, 347), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, new Point(762, 342), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(762, 343), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(762, 344), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, new Point(774, 353), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(774, 354), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(774, 355), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, new Point(761, 366), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(761, 367), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(761, 368), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, new Point(749, 354), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(749, 354), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(749, 354), 禁止复活: true, 立即刷新: true);
								break;
							case 1:
								副本.范围刷新怪物从地图实例("镇妖魔将03", 地图, 0, new Point(768, 354), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("镇妖神将03", 地图, 0, new Point(754, 354), 禁止复活: true, 立即刷新: true);
								地图.地图公告("<#T:990644>");
								地图.地图公告("<#T:990644>");
								break;
							case 2:
								副本.范围刷新怪物从地图实例("重甲狂兽人03", 地图, 0, new Point(766, 358), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(766, 359), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("破法狂兽人03", 地图, 0, new Point(757, 349), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, new Point(757, 350), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, new Point(756, 359), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(767, 348), 禁止复活: true, 立即刷新: true);
								break;
							}
							break;
						case 4:
							switch (num4)
							{
							case 0:
								副本.范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, new Point(1162, 193), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射04", 地图, 0, new Point(1163, 192), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, new Point(1162, 204), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射04", 地图, 0, new Point(1163, 205), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, new Point(1150, 205), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射04", 地图, 0, new Point(1149, 206), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, new Point(1151, 193), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射04", 地图, 0, new Point(1150, 192), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1157, 186), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1157, 186), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1157, 186), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1169, 198), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1169, 199), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1169, 200), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1155, 212), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1155, 212), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1155, 212), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1143, 200), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1143, 200), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1143, 200), 禁止复活: true, 立即刷新: true);
								break;
							case 1:
								副本.范围刷新怪物从地图实例("镇妖魔将04", 地图, 0, new Point(1163, 199), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("镇妖神将04", 地图, 0, new Point(1149, 199), 禁止复活: true, 立即刷新: true);
								地图.地图公告("<#T:990644>");
								地图.地图公告("<#T:990644>");
								break;
							case 2:
								副本.范围刷新怪物从地图实例("重甲狂兽人04", 地图, 0, new Point(1161, 204), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1161, 205), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("破法狂兽人04", 地图, 0, new Point(1151, 194), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1151, 193), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1151, 204), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1161, 194), 禁止复活: true, 立即刷新: true);
								break;
							}
							break;
						case 5:
							if (num4 == 0)
							{
								副本.范围刷新怪物从地图实例("秘法之囚01", 地图, 0, new Point(1017, 337), 禁止复活: true, 立即刷新: true);
								地图.地图公告("<#T:990646>");
								地图.地图公告("<#T:990646>");
							}
							else
							{
								副本.范围刷新怪物从地图实例("神武之囚01", 地图, 0, new Point(1017, 337), 禁止复活: true, 立即刷新: true);
								地图.地图公告("<#T:990645>");
								地图.地图公告("<#T:990645>");
							}
							副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1012, 337), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1012, 338), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1012, 339), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1018, 331), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1018, 332), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1018, 333), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1024, 337), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1024, 338), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1024, 339), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1018, 343), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1018, 344), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1018, 345), 禁止复活: true, 立即刷新: true);
							break;
						case 6:
							switch (num4)
							{
							case 0:
								副本.范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, new Point(875, 480), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射06", 地图, 0, new Point(874, 481), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, new Point(887, 468), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射06", 地图, 0, new Point(888, 467), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, new Point(887, 479), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射06", 地图, 0, new Point(888, 480), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, new Point(876, 468), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射06", 地图, 0, new Point(875, 467), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, new Point(868, 475), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸06", 地图, 0, new Point(868, 476), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, new Point(882, 461), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸06", 地图, 0, new Point(882, 462), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, new Point(894, 473), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸06", 地图, 0, new Point(894, 474), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, new Point(880, 487), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸06", 地图, 0, new Point(880, 487), 禁止复活: true, 立即刷新: true);
								break;
							case 1:
								副本.范围刷新怪物从地图实例("镇妖魔将06", 地图, 0, new Point(888, 474), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("镇妖神将06", 地图, 0, new Point(874, 474), 禁止复活: true, 立即刷新: true);
								地图.地图公告("<#T:990644>");
								地图.地图公告("<#T:990644>");
								break;
							case 2:
								副本.范围刷新怪物从地图实例("霸体狂尸06", 地图, 0, new Point(888, 480), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, new Point(888, 481), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("破法邪尸06", 地图, 0, new Point(875, 467), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸06", 地图, 0, new Point(875, 466), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸06", 地图, 0, new Point(875, 480), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, new Point(888, 467), 禁止复活: true, 立即刷新: true);
								break;
							}
							break;
						case 7:
							switch (num4)
							{
							case 0:
								副本.范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, new Point(1276, 318), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射07", 地图, 0, new Point(1275, 317), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, new Point(1287, 318), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射07", 地图, 0, new Point(1288, 317), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, new Point(1287, 329), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射07", 地图, 0, new Point(1288, 330), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, new Point(1275, 330), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射07", 地图, 0, new Point(1274, 331), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, new Point(1268, 325), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸07", 地图, 0, new Point(1268, 326), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, new Point(1282, 311), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸07", 地图, 0, new Point(1282, 312), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, new Point(1294, 323), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸07", 地图, 0, new Point(1294, 324), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, new Point(1280, 337), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸07", 地图, 0, new Point(1280, 338), 禁止复活: true, 立即刷新: true);
								break;
							case 1:
								副本.范围刷新怪物从地图实例("镇妖魔将07", 地图, 0, new Point(1288, 325), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("镇妖神将07", 地图, 0, new Point(1274, 325), 禁止复活: true, 立即刷新: true);
								地图.地图公告("<#T:990644>");
								地图.地图公告("<#T:990644>");
								break;
							case 2:
								副本.范围刷新怪物从地图实例("霸体狂尸07", 地图, 0, new Point(1288, 331), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, new Point(1288, 332), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("破法邪尸07", 地图, 0, new Point(1275, 318), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸07", 地图, 0, new Point(1275, 317), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸07", 地图, 0, new Point(1275, 331), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, new Point(1287, 319), 禁止复活: true, 立即刷新: true);
								break;
							}
							break;
						case 8:
							switch (num4)
							{
							case 0:
								副本.范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, new Point(1138, 456), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射08", 地图, 0, new Point(1137, 455), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, new Point(1149, 456), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射08", 地图, 0, new Point(1150, 455), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, new Point(1149, 467), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射08", 地图, 0, new Point(1150, 468), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, new Point(1137, 468), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("邪骸影射08", 地图, 0, new Point(1136, 469), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1130, 463), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1130, 464), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1144, 449), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1144, 450), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1156, 461), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1156, 462), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1142, 475), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1142, 476), 禁止复活: true, 立即刷新: true);
								break;
							case 1:
								副本.范围刷新怪物从地图实例("镇妖魔将08", 地图, 0, new Point(1150, 463), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("镇妖神将08", 地图, 0, new Point(1136, 463), 禁止复活: true, 立即刷新: true);
								地图.地图公告("<#T:990644>");
								地图.地图公告("<#T:990644>");
								break;
							case 2:
								副本.范围刷新怪物从地图实例("霸体狂尸08", 地图, 0, new Point(1150, 469), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1150, 470), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("破法邪尸08", 地图, 0, new Point(1137, 456), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1137, 455), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1137, 468), 禁止复活: true, 立即刷新: true);
								副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1149, 456), 禁止复活: true, 立即刷新: true);
								地图.地图公告("<#T:990640>");
								地图.地图公告("<#T:990643>");
								地图.地图公告("<#T:990643>");
								break;
							}
							break;
						case 9:
							if (九层魔塔.randomNum(0, 1, setRandom: true) == 0)
							{
								副本.范围刷新怪物从地图实例("秘法之囚02", 地图, 0, new Point(1006, 601), 禁止复活: true, 立即刷新: true);
							}
							else
							{
								副本.范围刷新怪物从地图实例("神武之囚02", 地图, 0, new Point(1006, 601), 禁止复活: true, 立即刷新: true);
							}
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1000, 599), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1000, 600), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1000, 601), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1006, 605), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1006, 606), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1006, 607), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1012, 598), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1012, 599), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1012, 600), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1007, 593), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1007, 594), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1007, 595), 禁止复活: true, 立即刷新: true);
							break;
						}
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(3.0);
						break;
					}
					case 4:
						if (地图.存活怪物总数 == 0)
						{
							地图.副本节点++;
							地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
						}
						break;
					case 5:
						foreach (玩家实例 item3 in 地图.获取玩家列表())
						{
							item3.角色数据.脚本变量[副本.数字_魔塔个人标准层数记录] = num2;
						}
						地图.地图公告($"<#P0:{num2}><#P1:0><#T:666728>");
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
						break;
					case 6:
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddHours(1.0);
						if (num2 == 1)
						{
							副本.刷新守卫从地图实例(7000, 地图, 游戏方向.下方, 九层魔塔.魔塔传送阵刷新表[num2]);
							副本.刷新守卫从地图实例(6813, 地图, 游戏方向.下方, new Point(1040, 81));
							副本.刷新守卫从地图实例(6815, 地图, 游戏方向.下方, new Point(1039, 82));
						}
						else
						{
							副本.刷新守卫从地图实例(7000, 地图, 游戏方向.下方, 九层魔塔.魔塔传送阵刷新表[num2]);
						}
						foreach (玩家实例 item4 in 地图.获取玩家列表())
						{
							item4.CallDefaultNPC(DefaultNPCType.MotaSuccess, true, num2);
						}
						if (num2 == 9)
						{
							地图.地图公告("<#T:666729>");
						}
						else
						{
							地图.地图公告("<#T:50030>");
						}
						break;
					}
				}
			}
			if (地图.数字变量[5] != 1 || !(主程.当前时间 > 地图.节点计时))
			{
				return;
			}
			if (地图.玩家列表.Count == 0)
			{
				地图.副本节点 = 255;
			}
			if (地图.副本节点 == 255)
			{
				地图.关闭副本();
			}
			else if (地图.副本节点 == 0)
			{
				地图.副本节点 = 10;
				地图.节点计时 = 主程.当前时间.AddSeconds(3.0);
			}
			else
			{
				if (地图.副本节点 <= 9)
				{
					return;
				}
				int num5;
				num5 = 地图.副本节点 % 10;
				int num6;
				num6 = 地图.副本节点 / 10;
				switch (num5)
				{
				case 0:
					switch (num6)
					{
					case 1:
						地图.地图公告("<#T:990638>");
						break;
					case 5:
					case 9:
						地图.地图公告("<#T:990637>");
						break;
					case 2:
					case 3:
					case 4:
					case 6:
					case 7:
					case 8:
						地图.地图公告("<#T:990636>");
						break;
					}
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(3.0);
					break;
				case 1:
					switch (num6)
					{
					case 1:
						地图.地图公告("<#T:990638>");
						break;
					case 5:
					case 9:
						地图.地图公告("<#T:990637>");
						break;
					case 2:
					case 3:
					case 4:
					case 6:
					case 7:
					case 8:
						地图.地图公告("<#T:990636>");
						break;
					}
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(3.0);
					break;
				case 2:
					switch (num6)
					{
					case 1:
					{
						地图.地图公告("<#T:990639>");
						int num8;
						num8 = 0;
						List<玩家实例> list2;
						list2 = 地图.获取玩家列表();
						foreach (玩家实例 item5 in list2)
						{
							if (item5.角色职业 == 游戏对象职业.战士)
							{
								num8++;
							}
							else if (item5.角色职业 == 游戏对象职业.法师)
							{
								num8++;
							}
							else if (item5.角色职业 == 游戏对象职业.道士)
							{
								num8++;
							}
							else if (item5.角色职业 == 游戏对象职业.刺客)
							{
								num8++;
							}
							else if (item5.角色职业 == 游戏对象职业.弓手)
							{
								num8++;
							}
							else if (item5.角色职业 == 游戏对象职业.龙枪)
							{
								num8++;
							}
						}
						foreach (玩家实例 item6 in list2)
						{
							item6.添加Buff时处理(2563, null);
							item6.添加Buff时处理(2571, null);
							item6.增加Buff层数(2571, num8 - 1);
						}
						break;
					}
					case 3:
					case 4:
						地图.地图公告("<#T:990639>");
						break;
					case 2:
					case 6:
					case 7:
					case 8:
						地图.地图公告("<#T:990653>");
						break;
					}
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(3.0);
					break;
				case 3:
				{
					int num7;
					num7 = 九层魔塔.randomNum(0, 2, setRandom: true);
					switch (num6)
					{
					case 1:
						副本.范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, new Point(1042, 73), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("邪骸影射01", 地图, 0, new Point(1043, 72), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, new Point(1042, 85), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("邪骸影射01", 地图, 0, new Point(1043, 86), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, new Point(1030, 85), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("邪骸影射01", 地图, 0, new Point(1029, 86), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, new Point(1030, 73), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("邪骸影射01", 地图, 0, new Point(1029, 72), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, new Point(1048, 77), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1048, 78), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1048, 79), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, new Point(1036, 91), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1036, 92), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1036, 93), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, new Point(1022, 80), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1022, 81), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1022, 82), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, new Point(1036, 65), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1036, 66), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, new Point(1036, 67), 禁止复活: true, 立即刷新: true);
						break;
					case 2:
						switch (num7)
						{
						case 0:
							副本.范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, new Point(893, 211), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射02", 地图, 0, new Point(892, 210), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, new Point(904, 210), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射02", 地图, 0, new Point(905, 209), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, new Point(904, 222), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射02", 地图, 0, new Point(905, 223), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, new Point(892, 222), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射02", 地图, 0, new Point(891, 223), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, new Point(885, 217), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(885, 218), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(885, 219), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, new Point(898, 204), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(898, 205), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(898, 206), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, new Point(911, 217), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(911, 218), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(911, 219), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, new Point(897, 231), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(897, 232), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(897, 233), 禁止复活: true, 立即刷新: true);
							break;
						case 1:
							副本.范围刷新怪物从地图实例("镇妖魔将02", 地图, 0, new Point(905, 217), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("镇妖神将02", 地图, 0, new Point(891, 217), 禁止复活: true, 立即刷新: true);
							地图.地图公告("<#T:990644>");
							地图.地图公告("<#T:990644>");
							break;
						case 2:
							副本.范围刷新怪物从地图实例("重甲狂兽人02", 地图, 0, new Point(903, 222), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(903, 223), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("破法狂兽人02", 地图, 0, new Point(893, 212), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, new Point(893, 213), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, new Point(893, 222), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, new Point(903, 212), 禁止复活: true, 立即刷新: true);
							break;
						}
						break;
					case 3:
						switch (num7)
						{
						case 0:
							副本.范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, new Point(767, 348), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射03", 地图, 0, new Point(768, 347), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, new Point(767, 359), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射03", 地图, 0, new Point(768, 360), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, new Point(755, 360), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射03", 地图, 0, new Point(754, 361), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, new Point(756, 348), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射03", 地图, 0, new Point(755, 347), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, new Point(762, 342), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(762, 343), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(762, 344), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, new Point(774, 353), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(774, 354), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(774, 355), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, new Point(761, 366), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(761, 367), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(761, 368), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, new Point(749, 354), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(749, 354), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(749, 354), 禁止复活: true, 立即刷新: true);
							break;
						case 1:
							副本.范围刷新怪物从地图实例("镇妖魔将03", 地图, 0, new Point(768, 354), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("镇妖神将03", 地图, 0, new Point(754, 354), 禁止复活: true, 立即刷新: true);
							地图.地图公告("<#T:990644>");
							地图.地图公告("<#T:990644>");
							break;
						case 2:
							副本.范围刷新怪物从地图实例("重甲狂兽人03", 地图, 0, new Point(766, 358), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(766, 359), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("破法狂兽人03", 地图, 0, new Point(757, 349), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, new Point(757, 350), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, new Point(756, 359), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, new Point(767, 348), 禁止复活: true, 立即刷新: true);
							break;
						}
						break;
					case 4:
						switch (num7)
						{
						case 0:
							副本.范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, new Point(1162, 193), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射04", 地图, 0, new Point(1163, 192), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, new Point(1162, 204), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射04", 地图, 0, new Point(1163, 205), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, new Point(1150, 205), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射04", 地图, 0, new Point(1149, 206), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, new Point(1151, 193), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射04", 地图, 0, new Point(1150, 192), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1157, 186), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1157, 186), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1157, 186), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1169, 198), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1169, 199), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1169, 200), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1155, 212), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1155, 212), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1155, 212), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1143, 200), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1143, 200), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1143, 200), 禁止复活: true, 立即刷新: true);
							break;
						case 1:
							副本.范围刷新怪物从地图实例("镇妖魔将04", 地图, 0, new Point(1163, 199), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("镇妖神将04", 地图, 0, new Point(1149, 199), 禁止复活: true, 立即刷新: true);
							地图.地图公告("<#T:990644>");
							地图.地图公告("<#T:990644>");
							break;
						case 2:
							副本.范围刷新怪物从地图实例("重甲狂兽人04", 地图, 0, new Point(1161, 204), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1161, 205), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("破法狂兽人04", 地图, 0, new Point(1151, 194), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1151, 193), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1151, 204), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1161, 194), 禁止复活: true, 立即刷新: true);
							break;
						}
						break;
					case 5:
						if (num7 == 0)
						{
							副本.范围刷新怪物从地图实例("秘法之囚01", 地图, 0, new Point(1017, 337), 禁止复活: true, 立即刷新: true);
							地图.地图公告("<#T:990646>");
							地图.地图公告("<#T:990646>");
						}
						else
						{
							副本.范围刷新怪物从地图实例("神武之囚01", 地图, 0, new Point(1017, 337), 禁止复活: true, 立即刷新: true);
							地图.地图公告("<#T:990645>");
							地图.地图公告("<#T:990645>");
						}
						副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1012, 337), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1012, 338), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1012, 339), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1018, 331), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1018, 332), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1018, 333), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1024, 337), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1024, 338), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1024, 339), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, new Point(1018, 343), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1018, 344), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, new Point(1018, 345), 禁止复活: true, 立即刷新: true);
						break;
					case 6:
						switch (num7)
						{
						case 0:
							副本.范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, new Point(875, 480), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射06", 地图, 0, new Point(874, 481), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, new Point(887, 468), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射06", 地图, 0, new Point(888, 467), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, new Point(887, 479), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射06", 地图, 0, new Point(888, 480), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, new Point(876, 468), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射06", 地图, 0, new Point(875, 467), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, new Point(868, 475), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸06", 地图, 0, new Point(868, 476), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, new Point(882, 461), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸06", 地图, 0, new Point(882, 462), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, new Point(894, 473), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸06", 地图, 0, new Point(894, 474), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, new Point(880, 487), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸06", 地图, 0, new Point(880, 487), 禁止复活: true, 立即刷新: true);
							break;
						case 1:
							副本.范围刷新怪物从地图实例("镇妖魔将06", 地图, 0, new Point(888, 474), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("镇妖神将06", 地图, 0, new Point(874, 474), 禁止复活: true, 立即刷新: true);
							地图.地图公告("<#T:990644>");
							地图.地图公告("<#T:990644>");
							break;
						case 2:
							副本.范围刷新怪物从地图实例("霸体狂尸06", 地图, 0, new Point(888, 480), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, new Point(888, 481), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("破法邪尸06", 地图, 0, new Point(875, 467), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸06", 地图, 0, new Point(875, 466), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸06", 地图, 0, new Point(875, 480), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, new Point(888, 467), 禁止复活: true, 立即刷新: true);
							break;
						}
						break;
					case 7:
						switch (num7)
						{
						case 0:
							副本.范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, new Point(1276, 318), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射07", 地图, 0, new Point(1275, 317), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, new Point(1287, 318), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射07", 地图, 0, new Point(1288, 317), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, new Point(1287, 329), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射07", 地图, 0, new Point(1288, 330), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, new Point(1275, 330), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射07", 地图, 0, new Point(1274, 331), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, new Point(1268, 325), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸07", 地图, 0, new Point(1268, 326), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, new Point(1282, 311), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸07", 地图, 0, new Point(1282, 312), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, new Point(1294, 323), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸07", 地图, 0, new Point(1294, 324), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, new Point(1280, 337), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸07", 地图, 0, new Point(1280, 338), 禁止复活: true, 立即刷新: true);
							break;
						case 1:
							副本.范围刷新怪物从地图实例("镇妖魔将07", 地图, 0, new Point(1288, 325), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("镇妖神将07", 地图, 0, new Point(1274, 325), 禁止复活: true, 立即刷新: true);
							地图.地图公告("<#T:990644>");
							地图.地图公告("<#T:990644>");
							break;
						case 2:
							副本.范围刷新怪物从地图实例("霸体狂尸07", 地图, 0, new Point(1288, 331), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, new Point(1288, 332), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("破法邪尸07", 地图, 0, new Point(1275, 318), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸07", 地图, 0, new Point(1275, 317), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸07", 地图, 0, new Point(1275, 331), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, new Point(1287, 319), 禁止复活: true, 立即刷新: true);
							break;
						}
						break;
					case 8:
						switch (num7)
						{
						case 0:
							副本.范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, new Point(1138, 456), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射08", 地图, 0, new Point(1137, 455), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, new Point(1149, 456), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射08", 地图, 0, new Point(1150, 455), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, new Point(1149, 467), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射08", 地图, 0, new Point(1150, 468), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, new Point(1137, 468), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("邪骸影射08", 地图, 0, new Point(1136, 469), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1130, 463), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1130, 464), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1144, 449), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1144, 450), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1156, 461), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1156, 462), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1142, 475), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1142, 476), 禁止复活: true, 立即刷新: true);
							break;
						case 1:
							副本.范围刷新怪物从地图实例("镇妖魔将08", 地图, 0, new Point(1150, 463), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("镇妖神将08", 地图, 0, new Point(1136, 463), 禁止复活: true, 立即刷新: true);
							地图.地图公告("<#T:990644>");
							地图.地图公告("<#T:990644>");
							break;
						case 2:
							副本.范围刷新怪物从地图实例("霸体狂尸08", 地图, 0, new Point(1150, 469), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1150, 470), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("破法邪尸08", 地图, 0, new Point(1137, 456), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1137, 455), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1137, 468), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1149, 456), 禁止复活: true, 立即刷新: true);
							地图.地图公告("<#T:990640>");
							地图.地图公告("<#T:990643>");
							地图.地图公告("<#T:990643>");
							break;
						}
						break;
					case 9:
						if (九层魔塔.randomNum(0, 1, setRandom: true) == 0)
						{
							副本.范围刷新怪物从地图实例("秘法之囚02", 地图, 0, new Point(1006, 601), 禁止复活: true, 立即刷新: true);
						}
						else
						{
							副本.范围刷新怪物从地图实例("神武之囚02", 地图, 0, new Point(1006, 601), 禁止复活: true, 立即刷新: true);
						}
						副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1000, 599), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1000, 600), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1000, 601), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1006, 605), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1006, 606), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1006, 607), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1012, 598), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1012, 599), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1012, 600), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1007, 593), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, new Point(1007, 594), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("感染僵尸08", 地图, 0, new Point(1007, 595), 禁止复活: true, 立即刷新: true);
						break;
					}
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(3.0);
					break;
				}
				case 4:
					if (地图.存活怪物总数 == 0)
					{
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
					}
					break;
				case 5:
					foreach (玩家实例 item7 in 地图.获取玩家列表())
					{
						item7.角色数据.脚本变量[副本.数字_魔塔个人标准层数记录] = num6;
					}
					地图.地图公告($"<#P0:{num6}><#P1:0><#T:666728>");
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
					break;
				case 6:
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddHours(1.0);
					if (num6 == 1)
					{
						副本.刷新守卫从地图实例(7000, 地图, 游戏方向.下方, 九层魔塔.魔塔传送阵刷新表[num6]);
						副本.刷新守卫从地图实例(6813, 地图, 游戏方向.下方, new Point(1040, 81));
						副本.刷新守卫从地图实例(6815, 地图, 游戏方向.下方, new Point(1039, 82));
					}
					else
					{
						副本.刷新守卫从地图实例(7000, 地图, 游戏方向.下方, 九层魔塔.魔塔传送阵刷新表[num6]);
					}
					break;
				}
				foreach (玩家实例 item8 in 地图.获取玩家列表())
				{
					item8.CallDefaultNPC(DefaultNPCType.MotaSuccess, true, num6);
				}
				if (num6 == 9)
				{
					地图.地图公告("<#T:666729>");
				}
				else
				{
					地图.地图公告("<#T:50030>");
				}
			}
		}

		public static string 传送门主对话(玩家实例 玩家, 守卫实例 对话守卫)
		{
			if (玩家.当前地图.地图编号 == 120)
			{
				玩家.玩家切换地图(147, 0, 0, 1);
			}
			else if (对话守卫.当前地图.副本节点 <= 24)
			{
				玩家.玩家切换地图(对话守卫.当前地图, 地图区域类型.未知区域, new Point(893, 212));
				if (对话守卫.当前地图.副本节点 == 17)
				{
					对话守卫.当前地图.副本节点 = 20;
					对话守卫.当前地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
			}
			else if (对话守卫.当前地图.副本节点 <= 34)
			{
				玩家.玩家切换地图(对话守卫.当前地图, 地图区域类型.未知区域, new Point(756, 349));
				if (对话守卫.当前地图.副本节点 == 27)
				{
					对话守卫.当前地图.副本节点 = 30;
					对话守卫.当前地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
			}
			else if (对话守卫.当前地图.副本节点 <= 44)
			{
				玩家.玩家切换地图(对话守卫.当前地图, 地图区域类型.未知区域, new Point(1151, 194));
				if (对话守卫.当前地图.副本节点 == 37)
				{
					对话守卫.当前地图.副本节点 = 40;
					对话守卫.当前地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
			}
			else if (对话守卫.当前地图.副本节点 <= 54)
			{
				玩家.玩家切换地图(对话守卫.当前地图, 地图区域类型.未知区域, new Point(1013, 332));
				if (对话守卫.当前地图.副本节点 == 47)
				{
					对话守卫.当前地图.副本节点 = 50;
					对话守卫.当前地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
			}
			else if (对话守卫.当前地图.副本节点 <= 64)
			{
				玩家.玩家切换地图(对话守卫.当前地图, 地图区域类型.未知区域, new Point(876, 469));
				if (对话守卫.当前地图.副本节点 == 57)
				{
					对话守卫.当前地图.副本节点 = 60;
					对话守卫.当前地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
			}
			else if (对话守卫.当前地图.副本节点 <= 74)
			{
				玩家.玩家切换地图(对话守卫.当前地图, 地图区域类型.未知区域, new Point(1276, 319));
				if (对话守卫.当前地图.副本节点 == 67)
				{
					对话守卫.当前地图.副本节点 = 70;
					对话守卫.当前地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
			}
			else if (对话守卫.当前地图.副本节点 <= 84)
			{
				玩家.玩家切换地图(对话守卫.当前地图, 地图区域类型.未知区域, new Point(1138, 457));
				if (对话守卫.当前地图.副本节点 == 77)
				{
					对话守卫.当前地图.副本节点 = 80;
					对话守卫.当前地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
			}
			else if (对话守卫.当前地图.副本节点 <= 94)
			{
				玩家.玩家切换地图(对话守卫.当前地图, 地图区域类型.未知区域, new Point(1001, 594));
				if (对话守卫.当前地图.副本节点 == 87)
				{
					对话守卫.当前地图.副本节点 = 90;
					对话守卫.当前地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
			}
			else
			{
				玩家.玩家切换地图(147, 0, 0, 1);
			}
			return string.Empty;
		}
	}
}
