using System.Collections.Generic;
using System.Drawing;
using System.Linq;
using 游戏服务器.地图类;

namespace 游戏服务器.副本类
{
	public static class 屠魔大厅
	{
		private static Dictionary<int, string[]> 屠魔大厅刷怪表 = new Dictionary<int, string[]>
		{
			[1] = new string[2] { "魔殿恶蛆", "魔殿红野猪" },
			[2] = new string[2] { "魔殿恶蛆", "魔殿红野猪" },
			[3] = new string[5] { "魔殿卫士", "魔殿卫士", "魔殿黑野猪", "魔殿黑野猪", "魔殿弓箭手" },
			[4] = new string[5] { "魔殿雕像", "魔殿雕像", "魔殿黑野猪", "魔殿黑野猪", "魔殿弓箭手" },
			[5] = new string[5] { "魔殿雕像", "魔殿雕像", "魔殿卫士", "魔殿卫士", "魔殿弓箭手" },
			[6] = new string[10] { "魔殿狼蛛", "魔殿狼蛛", "魔殿狼蛛", "魔殿狼蛛", "魔殿钢蛛", "魔殿钢蛛", "魔殿钢蛛", "魔殿钢蛛", "魔殿射手", "魔殿射手" },
			[7] = new string[10] { "魔殿邪蛛", "魔殿邪蛛", "魔殿邪蛛", "魔殿邪蛛", "魔殿钢蛛", "魔殿钢蛛", "魔殿钢蛛", "魔殿钢蛛", "魔殿射手", "魔殿射手" },
			[8] = new string[10] { "魔殿邪蛛", "魔殿邪蛛", "魔殿邪蛛", "魔殿邪蛛", "魔殿血巨人", "魔殿血巨人", "魔殿血巨人", "魔殿血巨人", "魔殿射手", "魔殿射手" },
			[9] = new string[10] { "魔殿血巨人", "魔殿血巨人", "魔殿血巨人", "魔殿血巨人", "魔殿血巨人", "魔殿血巨人", "魔殿血巨人", "魔殿血巨人", "魔殿射手", "魔殿射手" },
			[10] = new string[10] { "魔殿血蛙", "魔殿血蛙", "魔殿血蛙", "魔殿血蛙", "魔殿刀兵", "魔殿刀兵", "魔殿刀兵", "魔殿刀兵", "魔殿骷髅射手", "魔殿骷髅射手" },
			[11] = new string[10] { "魔殿血蛙", "魔殿血蛙", "魔殿血蛙", "魔殿血蛙", "魔殿刀兵", "魔殿刀兵", "魔殿刀兵", "魔殿刀兵", "魔殿骷髅射手", "魔殿骷髅射手" },
			[12] = new string[10] { "魔殿刀兵", "魔殿刀兵", "魔殿刀兵", "魔殿刀兵", "魔殿破甲兵", "魔殿破甲兵", "魔殿破甲兵", "魔殿破甲兵", "魔殿骷髅射手", "魔殿骷髅射手" },
			[13] = new string[10] { "魔殿锤兵", "魔殿锤兵", "魔殿锤兵", "魔殿锤兵", "魔殿破甲兵", "魔殿破甲兵", "魔殿破甲兵", "魔殿破甲兵", "魔殿骷髅射手", "魔殿骷髅射手" },
			[14] = new string[10] { "魔殿锤兵", "魔殿锤兵", "魔殿锤兵", "魔殿锤兵", "魔殿长枪兵", "魔殿长枪兵", "魔殿长枪兵", "魔殿长枪兵", "魔殿骷髅射手", "魔殿骷髅射手" },
			[15] = new string[10] { "魔殿刀斧手", "魔殿刀斧手", "魔殿刀斧手", "魔殿刀斧手", "魔殿长枪兵", "魔殿长枪兵", "魔殿长枪兵", "魔殿长枪兵", "魔殿骷髅射手", "魔殿骷髅射手" }
		};

		private static Dictionary<int, string> 屠魔大厅精英表 = new Dictionary<int, string>
		{
			[10] = "屠魔猪卫",
			[11] = "魔殿金刚",
			[12] = "魔殿血魔",
			[13] = "魔殿力士",
			[14] = "魔殿战将",
			[15] = "魔殿巨兽"
		};

		private static Dictionary<int, string[]> 屠魔秘境标准表 = new Dictionary<int, string[]>
		{
			[1] = new string[16]
			{
				"魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士",
				"魔殿牛魔法师", "魔殿牛魔法师", "魔殿牛魔法师", "魔殿牛魔法师", "魔殿牛魔法师", "魔殿牛魔将军"
			},
			[2] = new string[16]
			{
				"魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士", "魔殿牛魔战士",
				"魔殿牛魔法师", "魔殿牛魔法师", "魔殿牛魔法师", "魔殿牛魔法师", "魔殿牛魔法师", "魔殿牛魔将军"
			}
		};

		private static Dictionary<int, string[]> 屠魔秘境标准精英表 = new Dictionary<int, string[]>
		{
			[1] = new string[2] { "魔殿牛魔将军", "魔殿牛魔将军" },
			[2] = new string[2] { "魔殿牛魔将军", "魔殿牛魔将军" }
		};

		private static Dictionary<int, string[]> 屠魔秘境进阶表 = new Dictionary<int, string[]>
		{
			[1] = new string[15]
			{
				"魔殿牛魔侍卫", "魔殿牛魔侍卫", "魔殿牛魔侍卫", "魔殿牛魔侍卫", "魔殿牛魔侍卫", "魔殿牛魔侍卫", "魔殿牛魔侍卫", "魔殿牛魔侍卫", "魔殿牛魔侍卫", "魔殿牛魔侍卫",
				"魔殿牛魔侍卫", "魔殿牛魔侍卫", "魔殿牛魔法师", "魔殿牛魔法师", "魔殿牛魔法师"
			},
			[2] = new string[15]
			{
				"魔殿虚空龙仆", "魔殿虚空龙仆", "魔殿虚空龙仆", "魔殿虚空龙仆", "魔殿虚空龙仆", "魔殿虚空龙仆", "魔殿虚空龙仆", "魔殿虚空龙仆", "魔殿虚空龙仆", "魔殿虚空龙仆",
				"魔殿虚空龙仆", "魔殿虚空龙仆", "魔殿虚灵", "魔殿虚灵", "魔殿虚灵"
			}
		};

		private static Dictionary<int, string[]> 屠魔秘境进阶精英表 = new Dictionary<int, string[]>
		{
			[1] = new string[2] { "魔殿牛魔将军", "魔殿牛魔将军" },
			[2] = new string[1] { "魔殿虚灵之主" }
		};

		public static void 执行(地图实例 地图)
		{
			if (地图.数字变量[副本.数字_屠魔大厅级别] == 0)
			{
				if (主程.当前时间 > 地图.节点计时)
				{
					if (地图.玩家列表.Count == 0)
					{
						地图.副本节点 = 255;
					}
					if (地图.副本节点 == 0)
					{
						地图.地图公告("<#T:710781>");
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
					}
					else if (地图.副本节点 == 1)
					{
						地图.地图公告("<#T:710387>");
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
					}
					else if (地图.副本节点 == 2)
					{
						地图.地图公告("<#T:710781>");
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
					}
					else if (地图.副本节点 == 3)
					{
						地图.地图公告("<#T:710387>");
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
					}
					else if (地图.副本节点 == 4)
					{
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
					}
					else if (地图.副本节点 == 5)
					{
						地图.地图公告("<#T:710380>");
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(8.0);
					}
					else if (地图.副本节点 == 6)
					{
						地图.地图公告("<#T:710381>");
						地图.副本节点 = 10;
						地图.数字变量[副本.数字_屠魔大厅普通层数] = 1;
						地图.节点计时 = 主程.当前时间.AddSeconds(8.0);
						foreach (玩家实例 item in 地图.获取玩家列表())
						{
							item.添加Buff时处理(2541, null);
						}
					}
					else if (地图.副本节点 == 255)
					{
						地图.关闭副本();
					}
					else if (地图.数字变量[副本.数字_屠魔大厅普通层数] == 16)
					{
						副本.刷新守卫从地图实例(6215, 地图, 游戏方向.下方, new Point(1005, 273));
						地图.节点计时 = 主程.当前时间.AddSeconds(7200.0);
					}
					else if (地图.副本节点 % 10 == 0)
					{
						_ = 地图.数字变量[副本.数字_屠魔大厅普通层数];
						地图.地图公告("<#T:710382>");
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
					}
					else if (地图.副本节点 % 10 == 1)
					{
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
						Point[][] array;
						array = new Point[4][]
						{
							地图.获取怪物区域("屠魔大厅-右上刷怪区域").获取刷新范围(),
							地图.获取怪物区域("屠魔大厅-右下刷怪区域").获取刷新范围(),
							地图.获取怪物区域("屠魔大厅-左上刷怪区域").获取刷新范围(),
							地图.获取怪物区域("屠魔大厅-左下刷怪区域").获取刷新范围()
						};
						string[] array2;
						array2 = 屠魔大厅.屠魔大厅刷怪表[地图.数字变量[副本.数字_屠魔大厅普通层数]];
						foreach (string 怪物名字 in array2)
						{
							副本.范围刷新怪物从地图实例(怪物名字, 地图, 0, array[0], 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例(怪物名字, 地图, 0, array[1], 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例(怪物名字, 地图, 0, array[2], 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例(怪物名字, 地图, 0, array[3], 禁止复活: true, 立即刷新: true);
						}
						if (地图.数字变量[副本.数字_屠魔大厅普通层数] > 9)
						{
							副本.范围刷新怪物从地图实例(屠魔大厅.屠魔大厅精英表[地图.数字变量[副本.数字_屠魔大厅普通层数]], 地图, 0, array.FirstOrDefault((Point[] m) => true), 禁止复活: true, 立即刷新: true);
						}
					}
				}
				else if (地图.副本节点 % 10 == 2 && 地图.存活怪物总数 == 0)
				{
					地图.地图公告("你今天屠魔大厅最高挑战到" + 地图.数字变量[副本.数字_屠魔大厅普通层数] + "波");
					foreach (玩家实例 item2 in 地图.获取玩家列表())
					{
						item2.角色数据.脚本变量[副本.数字_屠魔大厅普通层数记录] = 地图.数字变量[副本.数字_屠魔大厅普通层数];
					}
					地图.数字变量[副本.数字_屠魔大厅普通层数] = 地图.数字变量[副本.数字_屠魔大厅普通层数] + 1;
					地图.副本节点 = 地图.数字变量[副本.数字_屠魔大厅普通层数] * 10;
				}
			}
			if (地图.数字变量[副本.数字_屠魔大厅级别] == 1 && 主程.当前时间 > 地图.节点计时)
			{
				if (地图.玩家列表.Count == 0)
				{
					地图.副本节点 = 255;
				}
				if (地图.副本节点 == 0)
				{
					地图.地图公告("<#T:710781>");
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
				else if (地图.副本节点 == 1)
				{
					地图.地图公告("<#T:710387>");
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
				else if (地图.副本节点 == 2)
				{
					地图.地图公告("<#T:710781>");
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
				else if (地图.副本节点 == 3)
				{
					地图.地图公告("<#T:710387>");
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
				else if (地图.副本节点 == 4)
				{
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
				else if (地图.副本节点 == 5)
				{
					地图.地图公告("<#T:710380>");
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(8.0);
				}
				else if (地图.副本节点 == 6)
				{
					地图.地图公告("<#T:710381>");
					地图.副本节点 = 10;
					地图.数字变量[副本.数字_屠魔秘境标准层数] = 1;
					地图.节点计时 = 主程.当前时间.AddSeconds(8.0);
					foreach (玩家实例 item3 in 地图.获取玩家列表())
					{
						item3.添加Buff时处理(2541, null);
					}
				}
				else if (地图.副本节点 == 255)
				{
					地图.关闭副本();
				}
				else if (地图.数字变量[副本.数字_屠魔秘境标准层数] == 3)
				{
					副本.刷新守卫从地图实例(6215, 地图, 游戏方向.下方, new Point(1092, 363));
					地图.节点计时 = 主程.当前时间.AddSeconds(7200.0);
				}
				else if (地图.副本节点 % 10 == 0)
				{
					_ = 地图.数字变量[副本.数字_屠魔秘境标准层数];
					地图.地图公告("<#T:710382>");
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
				else if (地图.副本节点 % 10 == 1)
				{
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
					Point[][] array3;
					array3 = new Point[4][]
					{
						地图.获取怪物区域("屠魔秘境标准-右上刷怪区域").获取刷新范围(),
						地图.获取怪物区域("屠魔秘境标准-右下刷怪区域").获取刷新范围(),
						地图.获取怪物区域("屠魔秘境标准-左上刷怪区域").获取刷新范围(),
						地图.获取怪物区域("屠魔秘境标准-左下刷怪区域").获取刷新范围()
					};
					string[] array2;
					array2 = 屠魔大厅.屠魔秘境标准表[地图.数字变量[副本.数字_屠魔秘境标准层数]];
					foreach (string 怪物名字2 in array2)
					{
						副本.范围刷新怪物从地图实例(怪物名字2, 地图, 0, array3[0], 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例(怪物名字2, 地图, 0, array3[1], 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例(怪物名字2, 地图, 0, array3[2], 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例(怪物名字2, 地图, 0, array3[3], 禁止复活: true, 立即刷新: true);
					}
					array2 = 屠魔大厅.屠魔秘境标准精英表[地图.数字变量[副本.数字_屠魔秘境标准层数]];
					foreach (string 怪物名字3 in array2)
					{
						副本.范围刷新怪物从地图实例(怪物名字3, 地图, 0, array3[0], 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例(怪物名字3, 地图, 0, array3[2], 禁止复活: true, 立即刷新: true);
					}
				}
				else if (地图.副本节点 % 10 == 2 && 地图.存活怪物总数 == 0)
				{
					地图.地图公告("你今天屠魔大厅最高挑战到" + 地图.数字变量[副本.数字_屠魔秘境标准层数] + "波");
					foreach (玩家实例 item4 in 地图.获取玩家列表())
					{
						item4.角色数据.脚本变量[副本.数字_屠魔大厅标准层数记录] = 地图.数字变量[副本.数字_屠魔秘境标准层数];
					}
					地图.数字变量[副本.数字_屠魔秘境标准层数] = 地图.数字变量[副本.数字_屠魔秘境标准层数] + 1;
					地图.副本节点 = 地图.数字变量[副本.数字_屠魔秘境标准层数] * 10;
				}
			}
			if (地图.数字变量[副本.数字_屠魔大厅级别] != 2 || !(主程.当前时间 > 地图.节点计时))
			{
				return;
			}
			if (地图.玩家列表.Count == 0)
			{
				地图.副本节点 = 255;
			}
			if (地图.副本节点 == 0)
			{
				地图.地图公告("<#T:710781>");
				地图.副本节点++;
				地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				return;
			}
			if (地图.副本节点 == 1)
			{
				地图.地图公告("<#T:710387>");
				地图.副本节点++;
				地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				return;
			}
			if (地图.副本节点 == 2)
			{
				地图.地图公告("<#T:710378>");
				地图.副本节点++;
				地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				return;
			}
			if (地图.副本节点 == 3)
			{
				地图.地图公告("<#T:710381>");
				地图.副本节点 = 10;
				地图.数字变量[副本.数字_屠魔秘境进阶层数] = 1;
				地图.节点计时 = 主程.当前时间.AddSeconds(8.0);
				{
					foreach (玩家实例 item5 in 地图.获取玩家列表())
					{
						item5.添加Buff时处理(2541, null);
						item5.设置Buff时间(2541, 300000);
					}
					return;
				}
			}
			if (地图.副本节点 == 255)
			{
				地图.关闭副本();
			}
			else if (地图.数字变量[副本.数字_屠魔秘境进阶层数] == 3)
			{
				副本.刷新守卫从地图实例(6215, 地图, 游戏方向.下方, new Point(1092, 363));
				地图.节点计时 = 主程.当前时间.AddSeconds(7200.0);
			}
			else if (地图.副本节点 % 10 == 0)
			{
				_ = 地图.数字变量[副本.数字_屠魔秘境进阶层数];
				地图.副本节点++;
				地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
			}
			else if (地图.副本节点 % 10 == 1)
			{
				地图.副本节点++;
				地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
				Point[][] array4;
				array4 = new Point[4][]
				{
					地图.获取怪物区域("屠魔秘境进阶-右上刷怪区域").获取刷新范围(),
					地图.获取怪物区域("屠魔秘境进阶-右下刷怪区域").获取刷新范围(),
					地图.获取怪物区域("屠魔秘境进阶-左上刷怪区域").获取刷新范围(),
					地图.获取怪物区域("屠魔秘境进阶-左下刷怪区域").获取刷新范围()
				};
				string[] array2;
				array2 = 屠魔大厅.屠魔秘境进阶表[地图.数字变量[副本.数字_屠魔秘境进阶层数]];
				foreach (string 怪物名字4 in array2)
				{
					副本.范围刷新怪物从地图实例(怪物名字4, 地图, 0, array4[0], 禁止复活: true, 立即刷新: true);
					副本.范围刷新怪物从地图实例(怪物名字4, 地图, 0, array4[1], 禁止复活: true, 立即刷新: true);
					副本.范围刷新怪物从地图实例(怪物名字4, 地图, 0, array4[2], 禁止复活: true, 立即刷新: true);
					副本.范围刷新怪物从地图实例(怪物名字4, 地图, 0, array4[3], 禁止复活: true, 立即刷新: true);
				}
				地图.地图公告("你今天屠魔大厅最高挑战到" + 地图.数字变量[副本.数字_屠魔秘境进阶层数] + "波1111");
				if (地图.数字变量[副本.数字_屠魔秘境进阶层数] == 1)
				{
					array2 = 屠魔大厅.屠魔秘境进阶精英表[地图.数字变量[副本.数字_屠魔秘境进阶层数]];
					foreach (string 怪物名字5 in array2)
					{
						副本.范围刷新怪物从地图实例(怪物名字5, 地图, 0, array4[0], 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例(怪物名字5, 地图, 0, array4[3], 禁止复活: true, 立即刷新: true);
					}
				}
				else if (地图.数字变量[副本.数字_屠魔秘境进阶层数] == 2)
				{
					array2 = 屠魔大厅.屠魔秘境进阶精英表[地图.数字变量[副本.数字_屠魔秘境进阶层数]];
					for (int i = 0; i < array2.Length; i++)
					{
						副本.范围刷新怪物从地图实例(array2[i], 地图, 0, new Point(1090, 364), 禁止复活: true, 立即刷新: true);
					}
				}
			}
			else
			{
				if (地图.副本节点 % 10 != 2 || 地图.存活怪物总数 != 0)
				{
					return;
				}
				地图.地图公告("你今天屠魔大厅最高挑战到" + 地图.数字变量[副本.数字_屠魔秘境进阶层数] + "波");
				foreach (玩家实例 item6 in 地图.获取玩家列表())
				{
					item6.角色数据.脚本变量[副本.数字_屠魔大厅进阶层数记录] = 地图.数字变量[副本.数字_屠魔秘境进阶层数];
				}
				地图.数字变量[副本.数字_屠魔秘境进阶层数] = 地图.数字变量[副本.数字_屠魔秘境进阶层数] + 1;
				地图.副本节点 = 地图.数字变量[副本.数字_屠魔秘境进阶层数] * 10;
			}
		}
	}
}
