using System.Collections.Generic;
using System.Drawing;
using 游戏服务器.地图类;
using 游戏服务器.模板类;

namespace 游戏服务器.副本类
{
	public static class 蜘蛛长廊
	{
		private static readonly Dictionary<int, string> 蜘蛛长廊刷新区域表 = new Dictionary<int, string>
		{
			[1] = "蜘蛛长廊一层",
			[2] = "蜘蛛长廊二层",
			[3] = "蜘蛛长廊三层"
		};

		private static readonly Dictionary<int, string[]> 标准普通刷怪表 = new Dictionary<int, string[]>
		{
			[1] = new string[17]
			{
				"恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12",
				"恶臭蜘蛛12", "恶臭蜘蛛12", "食尸蜘蛛13", "食尸蜘蛛13", "食尸蜘蛛13", "虫巢1438", "虫巢1438"
			},
			[2] = new string[29]
			{
				"食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11",
				"食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食尸蜘蛛13", "食尸蜘蛛13", "食尸蜘蛛13", "食尸蜘蛛13", "虫巢1438",
				"虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438"
			},
			[3] = new string[46]
			{
				"恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12",
				"恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "恶臭蜘蛛12", "食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11",
				"食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食人蜘蛛11", "食尸蜘蛛13", "食尸蜘蛛13", "食尸蜘蛛13", "食尸蜘蛛13", "食尸蜘蛛13",
				"食尸蜘蛛13", "食尸蜘蛛13", "食尸蜘蛛13", "食尸蜘蛛13", "食尸蜘蛛13", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438",
				"虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢5744"
			}
		};

		private static Dictionary<int, string[]> 标准精英刷怪表 = new Dictionary<int, string[]>
		{
			[1] = new string[4] { "苦痛蜘蛛15", "苦痛蜘蛛15", "苦痛蜘蛛15", "鬼面蜘蛛 猎魔17" },
			[2] = new string[5] { "血翼蜘蛛14", "血翼蜘蛛14", "血翼蜘蛛14", "血翼蜘蛛14", "鬼面蜘蛛 血魔27" },
			[3] = new string[12]
			{
				"苦痛蜘蛛15", "苦痛蜘蛛15", "苦痛蜘蛛15", "苦痛蜘蛛15", "苦痛蜘蛛15", "血翼蜘蛛14", "血翼蜘蛛14", "血翼蜘蛛14", "血翼蜘蛛14", "血翼蜘蛛14",
				"鬼面蜘蛛 天魔37", "虫巢5744"
			}
		};

		private static Dictionary<int, string[]> 进阶普通刷怪表 = new Dictionary<int, string[]>
		{
			[1] = new string[17]
			{
				"恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22",
				"恶臭蜘蛛22", "恶臭蜘蛛22", "食尸蜘蛛23", "食尸蜘蛛23", "食尸蜘蛛23", "虫巢1438", "虫巢1438"
			},
			[2] = new string[29]
			{
				"食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21",
				"食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食尸蜘蛛23", "食尸蜘蛛23", "食尸蜘蛛23", "食尸蜘蛛23", "虫巢1438",
				"虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438"
			},
			[3] = new string[46]
			{
				"恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22",
				"恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "恶臭蜘蛛22", "食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21",
				"食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食人蜘蛛21", "食尸蜘蛛23", "食尸蜘蛛23", "食尸蜘蛛23", "食尸蜘蛛23", "食尸蜘蛛23",
				"食尸蜘蛛23", "食尸蜘蛛23", "食尸蜘蛛23", "食尸蜘蛛23", "食尸蜘蛛23", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438",
				"虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢5744"
			}
		};

		private static Dictionary<int, string[]> 进阶精英刷怪表 = new Dictionary<int, string[]>
		{
			[1] = new string[4] { "苦痛蜘蛛25", "苦痛蜘蛛25", "苦痛蜘蛛25", "鬼面蜘蛛 猎魔17" },
			[2] = new string[5] { "血翼蜘蛛24", "血翼蜘蛛24", "血翼蜘蛛24", "血翼蜘蛛24", "鬼面蜘蛛 血魔27" },
			[3] = new string[12]
			{
				"苦痛蜘蛛25", "苦痛蜘蛛25", "苦痛蜘蛛25", "苦痛蜘蛛25", "苦痛蜘蛛25", "血翼蜘蛛24", "血翼蜘蛛24", "血翼蜘蛛24", "血翼蜘蛛24", "血翼蜘蛛24",
				"鬼面蜘蛛 天魔37", "虫巢5744"
			}
		};

		private static Dictionary<int, string[]> 困难普通刷怪表 = new Dictionary<int, string[]>
		{
			[1] = new string[17]
			{
				"恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32",
				"恶臭蜘蛛32", "恶臭蜘蛛32", "食尸蜘蛛33", "食尸蜘蛛33", "食尸蜘蛛33", "虫巢1438", "虫巢1438"
			},
			[2] = new string[29]
			{
				"食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31",
				"食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食尸蜘蛛33", "食尸蜘蛛33", "食尸蜘蛛33", "食尸蜘蛛33", "虫巢1438",
				"虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438"
			},
			[3] = new string[46]
			{
				"恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32",
				"恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "恶臭蜘蛛32", "食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31",
				"食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食人蜘蛛31", "食尸蜘蛛33", "食尸蜘蛛33", "食尸蜘蛛33", "食尸蜘蛛33", "食尸蜘蛛33",
				"食尸蜘蛛33", "食尸蜘蛛33", "食尸蜘蛛33", "食尸蜘蛛33", "食尸蜘蛛33", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438",
				"虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢1438", "虫巢5744"
			}
		};

		private static Dictionary<int, string[]> 困难精英刷怪表 = new Dictionary<int, string[]>
		{
			[1] = new string[4] { "苦痛蜘蛛35", "苦痛蜘蛛35", "苦痛蜘蛛35", "鬼面蜘蛛 猎魔17" },
			[2] = new string[5] { "血翼蜘蛛34", "血翼蜘蛛34", "血翼蜘蛛34", "血翼蜘蛛34", "鬼面蜘蛛 血魔27" },
			[3] = new string[12]
			{
				"苦痛蜘蛛35", "苦痛蜘蛛35", "苦痛蜘蛛35", "苦痛蜘蛛35", "苦痛蜘蛛35", "血翼蜘蛛34", "血翼蜘蛛34", "血翼蜘蛛34", "血翼蜘蛛34", "血翼蜘蛛34",
				"鬼面蜘蛛 天魔37", "虫巢5744"
			}
		};

		public static void 执行(地图实例 地图)
		{
			if (地图.数字变量[副本.数字_蜘蛛长廊级别] == 0 && 主程.当前时间 > 地图.节点计时)
			{
				if (地图.玩家列表.Count == 0)
				{
					地图.副本节点 = 255;
				}
				if (地图.副本节点 == 255)
				{
					地图.关闭副本();
				}
				else if (地图.副本节点 == 0)
				{
					地图.地图公告("<#T:710387>");
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
				}
				else if (地图.副本节点 == 1)
				{
					地图.副本节点 = 10;
					地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
				}
				else if (地图.副本节点 > 9)
				{
					int num;
					num = 地图.副本节点 % 10;
					int num2;
					num2 = 地图.副本节点 / 10;
					switch (num)
					{
					case 0:
						switch (num2)
						{
						case 1:
							地图.地图公告("<#T:990175>");
							break;
						case 2:
							地图.地图公告("<#T:990175>");
							break;
						case 3:
							地图.地图公告("<#T:990637>");
							break;
						}
						switch (num2)
						{
						case 1:
						{
							Point[] 刷新范围2;
							刷新范围2 = 地图.获取怪物区域("蜘蛛长廊一层").获取刷新范围();
							string[] array;
							array = 蜘蛛长廊.标准普通刷怪表[num2];
							for (int i = 0; i < array.Length; i++)
							{
								副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围2, 禁止复活: true, 立即刷新: true);
							}
							array = 蜘蛛长廊.标准精英刷怪表[num2];
							for (int i = 0; i < array.Length; i++)
							{
								副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围2, 禁止复活: true, 立即刷新: true);
							}
							break;
						}
						case 2:
						{
							Point[] 刷新范围3;
							刷新范围3 = 地图.获取怪物区域("蜘蛛长廊二层").获取刷新范围();
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(956, 210), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(961, 205), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(966, 200), 禁止复活: true, 立即刷新: true);
							string[] array;
							array = 蜘蛛长廊.标准普通刷怪表[num2];
							for (int i = 0; i < array.Length; i++)
							{
								副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围3, 禁止复活: true, 立即刷新: true);
							}
							array = 蜘蛛长廊.标准精英刷怪表[num2];
							for (int i = 0; i < array.Length; i++)
							{
								副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围3, 禁止复活: true, 立即刷新: true);
							}
							break;
						}
						case 3:
						{
							Point[] 刷新范围;
							刷新范围 = 地图.获取怪物区域("蜘蛛长廊三层").获取刷新范围();
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(986, 145), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(991, 140), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(997, 134), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(1002, 129), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(1007, 124), 禁止复活: true, 立即刷新: true);
							string[] array;
							array = 蜘蛛长廊.标准普通刷怪表[num2];
							for (int i = 0; i < array.Length; i++)
							{
								副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围, 禁止复活: true, 立即刷新: true);
							}
							array = 蜘蛛长廊.标准精英刷怪表[num2];
							for (int i = 0; i < array.Length; i++)
							{
								副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围, 禁止复活: true, 立即刷新: true);
							}
							break;
						}
						}
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
						break;
					case 1:
						if (地图.存活怪物总数 != 0)
						{
							break;
						}
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
						地图.地图公告($"<#P0:{num2}><#P1:0><#T:700389>");
						foreach (玩家实例 item in 地图.获取玩家列表())
						{
							item.角色数据.脚本变量[副本.数字_蜘蛛长廊标准层数记录] = num2;
						}
						break;
					case 2:
						地图.地图公告("<#T:50030>");
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddHours(1.0);
						switch (num2)
						{
						case 1:
							副本.刷新守卫从地图实例(6243, 地图, 游戏方向.下方, new Point(918, 254));
							break;
						case 2:
							副本.刷新守卫从地图实例(6243, 地图, 游戏方向.下方, new Point(977, 194));
							break;
						case 3:
							副本.刷新守卫从地图实例(6243, 地图, 游戏方向.下方, new Point(1015, 122));
							break;
						}
						break;
					}
				}
			}
			if (地图.数字变量[副本.数字_蜘蛛长廊级别] == 1 && 主程.当前时间 > 地图.节点计时)
			{
				if (地图.玩家列表.Count == 0)
				{
					地图.副本节点 = 255;
				}
				if (地图.副本节点 == 255)
				{
					地图.关闭副本();
				}
				else if (地图.副本节点 == 0)
				{
					地图.地图公告("<#T:710387>");
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
				}
				else if (地图.副本节点 == 1)
				{
					地图.副本节点 = 10;
					地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
				}
				else if (地图.副本节点 > 9)
				{
					int num3;
					num3 = 地图.副本节点 % 10;
					int num4;
					num4 = 地图.副本节点 / 10;
					switch (num3)
					{
					case 0:
						switch (num4)
						{
						case 1:
							地图.地图公告("<#T:990175>");
							break;
						case 2:
							地图.地图公告("<#T:990175>");
							break;
						case 3:
							地图.地图公告("<#T:990637>");
							break;
						}
						switch (num4)
						{
						case 1:
						{
							Point[] 刷新范围5;
							刷新范围5 = 地图.获取怪物区域("蜘蛛长廊一层").获取刷新范围();
							string[] array;
							array = 蜘蛛长廊.进阶普通刷怪表[num4];
							for (int i = 0; i < array.Length; i++)
							{
								副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围5, 禁止复活: true, 立即刷新: true);
							}
							array = 蜘蛛长廊.进阶精英刷怪表[num4];
							for (int i = 0; i < array.Length; i++)
							{
								副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围5, 禁止复活: true, 立即刷新: true);
							}
							break;
						}
						case 2:
						{
							Point[] 刷新范围6;
							刷新范围6 = 地图.获取怪物区域("蜘蛛长廊二层").获取刷新范围();
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(956, 210), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(961, 205), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(966, 200), 禁止复活: true, 立即刷新: true);
							string[] array;
							array = 蜘蛛长廊.进阶普通刷怪表[num4];
							for (int i = 0; i < array.Length; i++)
							{
								副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围6, 禁止复活: true, 立即刷新: true);
							}
							array = 蜘蛛长廊.进阶精英刷怪表[num4];
							for (int i = 0; i < array.Length; i++)
							{
								副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围6, 禁止复活: true, 立即刷新: true);
							}
							break;
						}
						case 3:
						{
							Point[] 刷新范围4;
							刷新范围4 = 地图.获取怪物区域("蜘蛛长廊三层").获取刷新范围();
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(986, 145), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(991, 140), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(997, 134), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(1002, 129), 禁止复活: true, 立即刷新: true);
							副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(1007, 124), 禁止复活: true, 立即刷新: true);
							string[] array;
							array = 蜘蛛长廊.进阶普通刷怪表[num4];
							for (int i = 0; i < array.Length; i++)
							{
								副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围4, 禁止复活: true, 立即刷新: true);
							}
							array = 蜘蛛长廊.进阶精英刷怪表[num4];
							for (int i = 0; i < array.Length; i++)
							{
								副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围4, 禁止复活: true, 立即刷新: true);
							}
							break;
						}
						}
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
						break;
					case 1:
						if (地图.存活怪物总数 != 0)
						{
							break;
						}
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
						地图.地图公告($"<#P0:{num4}><#P1:0><#T:700389>");
						foreach (玩家实例 item2 in 地图.获取玩家列表())
						{
							item2.角色数据.脚本变量[副本.数字_蜘蛛长廊进阶层数记录] = num4;
						}
						break;
					case 2:
						地图.地图公告("<#T:50030>");
						地图.副本节点++;
						地图.节点计时 = 主程.当前时间.AddHours(1.0);
						switch (num4)
						{
						case 1:
							副本.刷新守卫从地图实例(6243, 地图, 游戏方向.下方, new Point(918, 254));
							break;
						case 2:
							副本.刷新守卫从地图实例(6243, 地图, 游戏方向.下方, new Point(977, 194));
							break;
						case 3:
							副本.刷新守卫从地图实例(6243, 地图, 游戏方向.下方, new Point(1015, 122));
							break;
						}
						break;
					}
				}
			}
			if (地图.数字变量[副本.数字_蜘蛛长廊级别] != 2 || !(主程.当前时间 > 地图.节点计时))
			{
				return;
			}
			if (地图.玩家列表.Count == 0)
			{
				地图.副本节点 = 255;
			}
			if (地图.副本节点 == 255)
			{
				地图.关闭副本();
			}
			else if (地图.副本节点 == 0)
			{
				地图.地图公告("<#T:710387>");
				地图.副本节点++;
				地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
			}
			else if (地图.副本节点 == 1)
			{
				地图.副本节点 = 10;
				地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
			}
			else
			{
				if (地图.副本节点 <= 9)
				{
					return;
				}
				int num5;
				num5 = 地图.副本节点 % 10;
				int num6;
				num6 = 地图.副本节点 / 10;
				switch (num5)
				{
				case 0:
					switch (num6)
					{
					case 1:
						地图.地图公告("<#T:990175>");
						break;
					case 2:
						地图.地图公告("<#T:990175>");
						break;
					case 3:
						地图.地图公告("<#T:990637>");
						break;
					}
					switch (num6)
					{
					case 1:
					{
						Point[] 刷新范围8;
						刷新范围8 = 地图.获取怪物区域("蜘蛛长廊一层").获取刷新范围();
						string[] array;
						array = 蜘蛛长廊.困难普通刷怪表[num6];
						for (int i = 0; i < array.Length; i++)
						{
							副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围8, 禁止复活: true, 立即刷新: true);
						}
						array = 蜘蛛长廊.困难精英刷怪表[num6];
						for (int i = 0; i < array.Length; i++)
						{
							副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围8, 禁止复活: true, 立即刷新: true);
						}
						break;
					}
					case 2:
					{
						Point[] 刷新范围9;
						刷新范围9 = 地图.获取怪物区域("蜘蛛长廊二层").获取刷新范围();
						副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(956, 210), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(961, 205), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(966, 200), 禁止复活: true, 立即刷新: true);
						string[] array;
						array = 蜘蛛长廊.困难普通刷怪表[num6];
						for (int i = 0; i < array.Length; i++)
						{
							副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围9, 禁止复活: true, 立即刷新: true);
						}
						array = 蜘蛛长廊.困难精英刷怪表[num6];
						for (int i = 0; i < array.Length; i++)
						{
							副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围9, 禁止复活: true, 立即刷新: true);
						}
						break;
					}
					case 3:
					{
						Point[] 刷新范围7;
						刷新范围7 = 地图.获取怪物区域("蜘蛛长廊三层").获取刷新范围();
						副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(986, 145), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(991, 140), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(997, 134), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(1002, 129), 禁止复活: true, 立即刷新: true);
						副本.范围刷新怪物从地图实例("蜘蛛长廊陷阱", 地图, 0, new Point(1007, 124), 禁止复活: true, 立即刷新: true);
						string[] array;
						array = 蜘蛛长廊.困难普通刷怪表[num6];
						for (int i = 0; i < array.Length; i++)
						{
							副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围7, 禁止复活: true, 立即刷新: true);
						}
						array = 蜘蛛长廊.困难精英刷怪表[num6];
						for (int i = 0; i < array.Length; i++)
						{
							副本.范围刷新怪物从地图实例(array[i], 地图, 0, 刷新范围7, 禁止复活: true, 立即刷新: true);
						}
						break;
					}
					}
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
					break;
				case 1:
					if (地图.存活怪物总数 != 0)
					{
						break;
					}
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
					地图.地图公告($"<#P0:{num6}><#P1:0><#T:700389>");
					{
						foreach (玩家实例 item3 in 地图.获取玩家列表())
						{
							item3.角色数据.脚本变量[副本.数字_蜘蛛长廊困难层数记录] = num6;
						}
						break;
					}
				case 2:
					地图.地图公告("<#T:50030>");
					地图.副本节点++;
					地图.节点计时 = 主程.当前时间.AddHours(1.0);
					switch (num6)
					{
					case 1:
						副本.刷新守卫从地图实例(6243, 地图, 游戏方向.下方, new Point(918, 254));
						break;
					case 2:
						副本.刷新守卫从地图实例(6243, 地图, 游戏方向.下方, new Point(977, 194));
						break;
					case 3:
						副本.刷新守卫从地图实例(6243, 地图, 游戏方向.下方, new Point(1015, 122));
						break;
					}
					break;
				}
			}
		}

		public static string 传送门主对话(玩家实例 玩家, 守卫实例 对话守卫)
		{
			if (对话守卫.当前地图.副本节点 <= 21)
			{
				玩家.玩家切换地图(对话守卫.当前地图, 地图区域类型.未知区域, new Point(946, 225));
				if (对话守卫.当前地图.副本节点 == 13)
				{
					对话守卫.当前地图.副本节点 = 20;
					对话守卫.当前地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
			}
			else if (对话守卫.当前地图.副本节点 <= 31)
			{
				玩家.玩家切换地图(对话守卫.当前地图, 地图区域类型.未知区域, new Point(984, 153));
				if (对话守卫.当前地图.副本节点 == 23)
				{
					对话守卫.当前地图.副本节点 = 30;
					对话守卫.当前地图.节点计时 = 主程.当前时间.AddSeconds(5.0);
				}
			}
			else
			{
				玩家.玩家切换地图(147, 0, 0, 1);
			}
			return string.Empty;
		}
	}
}
