using System.Collections.Generic;
using 游戏服务器.地图类;
using 游戏服务器.模板类;
using 游戏服务器.数据类;
using 游戏服务器.网络类;

namespace 游戏服务器.副本类
{
	public static class 阿诗
	{
		public static string 对话(玩家实例 玩家, 守卫实例 对话守卫)
		{
			if (玩家.管理员模式)
			{
				玩家.发送系统消息(玩家.对话页面.ToString() ?? "");
			}
			if (玩家.对话页面 == 0)
			{
				if (主程.开区节点 < 2)
				{
					return "<#P0:0><#P1:0><#T:666470>";
				}
				if (主程.开区节点 > 2 && 主程.开区节点 < 5)
				{
					return "<#P0:0><#P1:0><#T:666832>";
				}
				return "<#P0:0><#P1:0><#T:666835>";
			}
			if (玩家.对话页面 > 0 && 玩家.对话页面 < 8)
			{
				return new Dictionary<int, string>
				{
					[1] = "<#P0:0><#P1:0><#T:666833>",
					[2] = "<#P0:0><#P1:0><#T:667280>",
					[3] = "<#P0:0><#P1:0><#T:710284>",
					[4] = "<#P0:0><#P1:0><#T:668179>",
					[5] = "<#P0:0><#P1:0><#T:668184>",
					[6] = "<#P0:0><#P1:0><#T:668151>",
					[7] = "<#P0:0><#P1:0><#T:668160>"
				}[玩家.对话页面];
			}
			装备数据 装备数据;
			装备数据 = null;
			if (玩家.对话页面 > 30 && 玩家.对话页面 < 50)
			{
				Dictionary<int, int[]> dictionary;
				dictionary = new Dictionary<int, int[]>();
				dictionary[31] = new int[8] { 0, 99971101, 667945, 667946, 667947, 125, 145, 170 };
				dictionary[32] = new int[8] { 0, 99971102, 667948, 667949, 667950, 125, 145, 170 };
				dictionary[33] = new int[8] { 0, 99971103, 667951, 667952, 667953, 125, 145, 170 };
				dictionary[34] = new int[8] { 0, 99971104, 667954, 667955, 667956, 125, 145, 170 };
				dictionary[35] = new int[8] { 0, 99971105, 710281, 710282, 710283, 125, 145, 170 };
				dictionary[36] = new int[8] { 0, 99971106, 710285, 710286, 710287, 125, 145, 170 };
				dictionary[41] = new int[8] { 0, 99971101, 668135, 668136, 668137, 400, 450, 550 };
				dictionary[42] = new int[8] { 0, 99971102, 668138, 668139, 668140, 400, 450, 550 };
				dictionary[43] = new int[8] { 0, 99971103, 668141, 668142, 668143, 400, 450, 550 };
				dictionary[44] = new int[8] { 0, 99971104, 668144, 668145, 668146, 400, 450, 550 };
				dictionary[45] = new int[8] { 0, 99971105, 710291, 710292, 710293, 400, 450, 550 };
				dictionary[46] = new int[8] { 0, 99971106, 667945, 667946, 667947, 400, 450, 550 };
				if (!dictionary.TryGetValue(玩家.对话页面, out var value))
				{
					return string.Empty;
				}
				if (!(玩家.根据编号获取背包物品(value[1]) is 装备数据 装备数据2))
				{
					return "<#P0:0><#P1:0><#T:667958>";
				}
				if (装备数据2.孔洞颜色.Count == 0)
				{
					return "<#P0:" + value[5] + "><#P1:0><#T:" + value[2] + ">";
				}
				if (装备数据2.孔洞颜色.Count == 1)
				{
					return "<#P0:" + value[6] + "><#P1:0><#T:" + value[3] + ">";
				}
				if (装备数据2.孔洞颜色.Count == 2)
				{
					return "<#P0:" + value[7] + "><#P1:0><#T:" + value[4] + ">";
				}
			}
			if (玩家.对话页面 > 50 && 玩家.对话页面 < 100)
			{
				Dictionary<int, string[]> dictionary2;
				dictionary2 = new Dictionary<int, string[]>();
				dictionary2[51] = new string[4] { "99971201", "在您的背包中找到了精修玉佩·赤霞(无孔)<br>您是否需要消耗：精修玉佩·赤霞(无孔)+30幸运币，兑换极品玉佩·赤霞(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·赤霞(单孔)<br>您是否需要消耗：精修玉佩·赤霞(单孔)+31幸运币，兑换极品玉佩·赤霞(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·赤霞(双孔)<br>您是否需要消耗：精修玉佩·赤霞(双孔)+33幸运币，兑换极品玉佩·赤霞(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[52] = new string[4] { "99971202", "在您的背包中找到了精修玉佩·湛波(无孔)<br>您是否需要消耗：精修玉佩·湛波(无孔)+30幸运币，兑换极品玉佩·湛波(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·湛波(单孔)<br>您是否需要消耗：精修玉佩·湛波(单孔)+31幸运币，兑换极品玉佩·湛波(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·湛波(双孔)<br>您是否需要消耗：精修玉佩·湛波(双孔)+33幸运币，兑换极品玉佩·湛波(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[53] = new string[4] { "99971203", "在您的背包中找到了精修玉佩·碧血(无孔)<br>您是否需要消耗：精修玉佩·碧血(无孔)+30幸运币，兑换极品玉佩·碧血(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·碧血(单孔)<br>您是否需要消耗：精修玉佩·碧血(单孔)+31幸运币，兑换极品玉佩·碧血(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·碧血(双孔)<br>您是否需要消耗：精修玉佩·碧血(双孔)+33幸运币，兑换极品玉佩·碧血(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[54] = new string[4] { "99971204", "在您的背包中找到了精修玉佩·木槿(无孔)<br>您是否需要消耗：精修玉佩·木槿(无孔)+30幸运币，兑换极品玉佩·木槿(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·木槿(单孔)<br>您是否需要消耗：精修玉佩·木槿(单孔)+31幸运币，兑换极品玉佩·木槿(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·木槿(双孔)<br>您是否需要消耗：精修玉佩·木槿(双孔)+33幸运币，兑换极品玉佩·木槿(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[55] = new string[4] { "99971205", "在您的背包中找到了精修玉佩·金雷(无孔)<br>您是否需要消耗：精修玉佩·金雷(无孔)+30幸运币，兑换极品玉佩·金雷(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·金雷(单孔)<br>您是否需要消耗：精修玉佩·金雷(单孔)+31幸运币，兑换极品玉佩·金雷(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·金雷(双孔)<br>您是否需要消耗：精修玉佩·金雷(双孔)+33幸运币，兑换极品玉佩·金雷(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[56] = new string[4] { "99971206", "在您的背包中找到了精修玉佩·褐岩(无孔)<br>您是否需要消耗：精修玉佩·褐岩(无孔)+30幸运币，兑换极品玉佩·褐岩(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·褐岩(单孔)<br>您是否需要消耗：精修玉佩·褐岩(单孔)+31幸运币，兑换极品玉佩·褐岩(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·褐岩(双孔)<br>您是否需要消耗：精修玉佩·褐岩(双孔)+33幸运币，兑换极品玉佩·褐岩(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[61] = new string[4] { "99990512", "在您的背包中找到了寒狼护肩(无孔)<br>您是否需要消耗：寒狼护肩(无孔)+200学宫积分，兑换破凰护肩(圣战)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了寒狼护肩(单孔)<br>您是否需要消耗：寒狼护肩(单孔)+300学宫积分，兑换破凰护肩(圣战)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了寒狼护肩(双孔)<br>您是否需要消耗：寒狼护肩(双孔)+450学宫积分，兑换破凰护肩(圣战)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[62] = new string[4] { "99990522", "在您的背包中找到了火纹护肩(无孔)<br>您是否需要消耗：火纹护肩(无孔)+200学宫积分，兑换破凰护肩(法神)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了火纹护肩(单孔)<br>您是否需要消耗：火纹护肩(单孔)+300学宫积分，兑换破凰护肩(法神)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了火纹护肩(双孔)<br>您是否需要消耗：火纹护肩(双孔)+450学宫积分，兑换破凰护肩(法神)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[63] = new string[4] { "99990532", "在您的背包中找到了流云护肩(无孔)<br>您是否需要消耗：流云护肩(无孔)+200学宫积分，兑换破凰护肩(天尊)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了流云护肩(单孔)<br>您是否需要消耗：流云护肩(单孔)+300学宫积分，兑换破凰护肩(天尊)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了流云护肩(双孔)<br>您是否需要消耗：流云护肩(双孔)+450学宫积分，兑换破凰护肩(天尊)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[64] = new string[4] { "99990542", "在您的背包中找到了霜影护肩(无孔)<br>您是否需要消耗：霜影护肩(无孔)+200学宫积分，兑换破凰护肩(影刺)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了霜影护肩(单孔)<br>您是否需要消耗：霜影护肩(单孔)+300学宫积分，兑换破凰护肩(影刺)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了霜影护肩(双孔)<br>您是否需要消耗：霜影护肩(双孔)+450学宫积分，兑换破凰护肩(影刺)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[65] = new string[4] { "99990552", "在您的背包中找到了绿萤护肩(无孔)<br>您是否需要消耗：绿萤护肩(无孔)+200学宫积分，兑换破凰护肩(箭灵)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了绿萤护肩(单孔)<br>您是否需要消耗：绿萤护肩(单孔)+300学宫积分，兑换破凰护肩(箭灵)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了绿萤护肩(双孔)<br>您是否需要消耗：绿萤护肩(双孔)+450学宫积分，兑换破凰护肩(箭灵)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[66] = new string[4] { "99990562", "在您的背包中找到了虎贲护肩(无孔)<br>您是否需要消耗：虎贲护肩(无孔)+200学宫积分，兑换破凰护肩(龙枪)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了虎贲护肩(单孔)<br>您是否需要消耗：虎贲护肩(单孔)+300学宫积分，兑换破凰护肩(龙枪)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了虎贲护肩(双孔)<br>您是否需要消耗：虎贲护肩(双孔)+450学宫积分，兑换破凰护肩(龙枪)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[71] = new string[4] { "99990516", "在您的背包中找到了寒狼护腕(无孔)<br>您是否需要消耗：寒狼护腕(无孔)+75学宫积分，兑换破凰护腕(圣战)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了寒狼护腕(单孔)<br>您是否需要消耗：寒狼护腕(单孔)+150学宫积分，兑换破凰护腕(圣战)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了寒狼护腕(双孔)<br>您是否需要消耗：寒狼护腕(双孔)+300学宫积分，兑换破凰护腕(圣战)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[72] = new string[4] { "99990526", "在您的背包中找到了火纹护腕(无孔)<br>您是否需要消耗：火纹护腕(无孔)+75学宫积分，兑换破凰护腕(法神)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了火纹护腕(单孔)<br>您是否需要消耗：火纹护腕(单孔)+150学宫积分，兑换破凰护腕(法神)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了火纹护腕(双孔)<br>您是否需要消耗：火纹护腕(双孔)+300学宫积分，兑换破凰护腕(法神)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[73] = new string[4] { "99990536", "在您的背包中找到了流云护腕(无孔)<br>您是否需要消耗：流云护腕(无孔)+75学宫积分，兑换破凰护腕(天尊)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了流云护腕(单孔)<br>您是否需要消耗：流云护腕(单孔)+150学宫积分，兑换破凰护腕(天尊)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了流云护腕(双孔)<br>您是否需要消耗：流云护腕(双孔)+300学宫积分，兑换破凰护腕(天尊)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[74] = new string[4] { "99990546", "在您的背包中找到了霜影护腕(无孔)<br>您是否需要消耗：霜影护腕(无孔)+75学宫积分，兑换破凰护腕(影刺)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了霜影护腕(单孔)<br>您是否需要消耗：霜影护腕(单孔)+150学宫积分，兑换破凰护腕(影刺)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了霜影护腕(双孔)<br>您是否需要消耗：霜影护腕(双孔)+300学宫积分，兑换破凰护腕(影刺)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[75] = new string[4] { "99990556", "在您的背包中找到了绿萤护腕(无孔)<br>您是否需要消耗：绿萤护腕(无孔)+75学宫积分，兑换破凰护腕(箭灵)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了绿萤护腕(单孔)<br>您是否需要消耗：绿萤护腕(单孔)+150学宫积分，兑换破凰护腕(箭灵)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了绿萤护腕(双孔)<br>您是否需要消耗：绿萤护腕(双孔)+300学宫积分，兑换破凰护腕(箭灵)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				dictionary2[76] = new string[4] { "99990566", "在您的背包中找到了虎贲护腕(无孔)<br>您是否需要消耗：虎贲护腕(无孔)+75学宫积分，兑换破凰护腕(龙枪)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了虎贲护腕(单孔)<br>您是否需要消耗：虎贲护腕(单孔)+150学宫积分，兑换破凰护腕(龙枪)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了虎贲护腕(双孔)<br>您是否需要消耗：虎贲护腕(双孔)+300学宫积分，兑换破凰护腕(龙枪)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>" };
				if (!dictionary2.TryGetValue(玩家.对话页面, out var value2))
				{
					return string.Empty;
				}
				if (!(玩家.根据编号获取背包物品(int.Parse(value2[0])) is 装备数据 装备数据3))
				{
					return "<#P0:0><#P1:0><#T:667958>";
				}
				if (装备数据3.孔洞颜色.Count == 0)
				{
					return value2[1] ?? "";
				}
				if (装备数据3.孔洞颜色.Count == 1)
				{
					return value2[2] ?? "";
				}
				if (装备数据3.孔洞颜色.Count == 2)
				{
					return value2[3] ?? "";
				}
			}
			if (玩家.对话页面 > 300)
			{
				Dictionary<int, int[]> dictionary;
				dictionary = new Dictionary<int, int[]>();
				dictionary[311] = new int[7] { 0, 99971101, 111048, 99971201, 125, 145, 170 };
				dictionary[321] = new int[7] { 0, 99971102, 111049, 99971202, 125, 145, 170 };
				dictionary[331] = new int[7] { 0, 99971103, 111050, 99971203, 125, 145, 170 };
				dictionary[341] = new int[7] { 0, 99971104, 111080, 99971204, 125, 145, 170 };
				dictionary[351] = new int[7] { 0, 99971105, 111093, 99971205, 125, 145, 170 };
				dictionary[361] = new int[7] { 0, 99971106, 111303, 99971206, 125, 145, 170 };
				dictionary[411] = new int[7] { 0, 99971101, 91143, 99971201, 400, 450, 550 };
				dictionary[421] = new int[7] { 0, 99971102, 91143, 99971202, 400, 450, 550 };
				dictionary[431] = new int[7] { 0, 99971103, 91143, 99971203, 400, 450, 550 };
				dictionary[441] = new int[7] { 0, 99971104, 91143, 99971204, 400, 450, 550 };
				dictionary[451] = new int[7] { 0, 99971105, 91143, 99971205, 400, 450, 550 };
				dictionary[461] = new int[7] { 0, 99971106, 91143, 99971206, 400, 450, 550 };
				dictionary[511] = new int[7] { 0, 99971201, 91185, 99971301, 30, 31, 33 };
				dictionary[521] = new int[7] { 0, 99971202, 91185, 99971302, 30, 31, 33 };
				dictionary[531] = new int[7] { 0, 99971203, 91185, 99971303, 30, 31, 33 };
				dictionary[541] = new int[7] { 0, 99971204, 91185, 99971304, 30, 31, 33 };
				dictionary[551] = new int[7] { 0, 99971205, 91185, 99971305, 30, 31, 33 };
				dictionary[561] = new int[7] { 0, 99971206, 91185, 99971306, 30, 31, 33 };
				dictionary[611] = new int[7] { 0, 99990512, 91143, 99990712, 200, 300, 450 };
				dictionary[621] = new int[7] { 0, 99990522, 91143, 99990722, 200, 300, 450 };
				dictionary[631] = new int[7] { 0, 99990532, 91143, 99990732, 200, 300, 450 };
				dictionary[641] = new int[7] { 0, 99990542, 91143, 99990742, 200, 300, 450 };
				dictionary[651] = new int[7] { 0, 99990552, 91143, 99990752, 200, 300, 450 };
				dictionary[661] = new int[7] { 0, 99990562, 91143, 99990762, 200, 300, 450 };
				dictionary[711] = new int[7] { 0, 99990516, 91143, 99990716, 75, 150, 300 };
				dictionary[721] = new int[7] { 0, 99990526, 91143, 99990726, 75, 150, 300 };
				dictionary[731] = new int[7] { 0, 99990536, 91143, 99990736, 75, 150, 300 };
				dictionary[741] = new int[7] { 0, 99990546, 91143, 99990746, 75, 150, 300 };
				dictionary[751] = new int[7] { 0, 99990556, 91143, 99990756, 75, 150, 300 };
				dictionary[761] = new int[7] { 0, 99990566, 91143, 99990766, 75, 150, 300 };
				if (!dictionary.TryGetValue(玩家.对话页面, out var value3))
				{
					return string.Empty;
				}
				if (!(玩家.根据编号获取背包物品(value3[1]) is 装备数据 装备数据4))
				{
					return "<#P0:0><#P1:0><#T:668148>";
				}
				int num;
				num = 0;
				if (装备数据4.孔洞颜色.Count == 0)
				{
					num = value3[4];
				}
				else if (装备数据4.孔洞颜色.Count == 1)
				{
					num = value3[5];
				}
				else if (装备数据4.孔洞颜色.Count == 2)
				{
					num = value3[6];
				}
				List<物品数据> list;
				list = 玩家.查找背包物品(value3[2], num);
				if (list == null)
				{
					return "<#P0:0><#P1:0><#T:667959>";
				}
				玩家.消耗背包物品(num, list, "兑换玉佩");
				阿诗.盟重省_阿诗_确认兑换(玩家, 装备数据4, value3[3]);
			}
			return string.Empty;
		}

		public static void 盟重省_阿诗_确认兑换(玩家实例 玩家, 装备数据 装备, int 物品编号)
		{
			装备.对应模板.V = 游戏物品.数据表[物品编号];
			玩家.角色数据.网络连接.发送封包(new 删除玩家物品
			{
				背包类型 = 装备.物品容器.V,
				物品位置 = 装备.物品位置.V
			});
			玩家.角色数据.网络连接.发送封包(new 玩家物品变动
			{
				物品描述 = 装备.字节描述()
			});
		}
	}
}
