namespace 游戏服务器.网络类
{
	[封包信息描述(来源 = 封包来源.服务器, 编号 = 57, 长度 = 55, 注释 = "复活信息(无此封包不会弹出复活框)")]
	public sealed class 发送复活信息 : 游戏封包
	{
		[封包字段描述(下标 = 2, 长度 = 4)]
		public int 等待时间;

		[封包字段描述(下标 = 6, 长度 = 4)]
		public int 凶手编号;

		[封包字段描述(下标 = 10, 长度 = 45)]
		public byte[] 复活描述;

		public override ushort 封包编号 => 57;

		public 发送复活信息()
		{
			this.复活描述 = new byte[45]
			{
				0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
				161, 134, 1, 0, 1, 0, 0, 0, 2, 1,
				0, 0, 0, 100, 0, 0, 0, 3, 0, 0,
				0, 0, 0, 0, 0, 0, 4, 161, 134, 1,
				0, 1, 0, 0, 0
			};
		}
	}
}
